Hi @13816004815 @raokaihao 

I am unable to reproduce this error. For me the following script runs successfully. 

```
resource "opentelekomcloud_rds_instance_v3" "rds0" {
  availability_zone = ["eu-de-01", "eu-de-02"]

  db {
    password = "HBM!pWpQr+7mt5=BMRxi"
    port     = "3306"
    type     = "MySQL"
    version  = "8.0"
  }
  name              = "mysql-harbor-new-version"
  subnet_id         = "xxx"
  vpc_id            = "xxx"
  security_group_id = "xxx"
  flavor            = "rds.mysql.n1.medium.2.ha"
  volume {
    size = 40
    type = "CLOUDSSD"
  }

  ha_replication_mode    = "async"
  lower_case_table_names = "1"
  ssl_enable             = false

  tags = {
    "ads-service" = "new_version"
    "env"         = "poc"
  }
}
```

Here is the output:
```
  # opentelekomcloud_rds_instance_v3.rds0 will be created
  + resource "opentelekomcloud_rds_instance_v3" "rds0" {
      + autoscaling_enabled    = (known after apply)
      + availability_zone      = [
          + "eu-de-01",
          + "eu-de-02",
        ]
      + availability_zones     = (known after apply)
      + created                = (known after apply)
      + flavor                 = "rds.mysql.n1.medium.2.ha"
      + ha_replication_mode    = "async"
      + id                     = (known after apply)
      + lower_case_table_names = "1"
      + name                   = "mysql-harbor-new-version"
      + nodes                  = (known after apply)
      + private_ips            = (known after apply)
      + restored_backup_id     = (known after apply)
      + security_group_id      = "xxx"
      + ssl_enable             = false
      + subnet_id              = "xxx"
      + tags                   = {
          + "ads-service" = "new_version"
          + "env"         = "poc"
        }
      + vpc_id                 = "xxx"

      + backup_strategy (known after apply)

      + db {
          + password  = (sensitive value)
          + port      = 3306
          + type      = "MySQL"
          + user_name = (known after apply)
          + version   = "8.0"
        }

      + volume {
          + disk_encryption_id = (known after apply)
          + size               = 40
          + type               = "CLOUDSSD"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

opentelekomcloud_rds_instance_v3.rds0: Creating...
opentelekomcloud_rds_instance_v3.rds0: Still creating... [10s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [20s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [30s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [40s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [50s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [1m0s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [1m10s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [1m20s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [1m30s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [1m40s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [1m50s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [2m0s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [2m10s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [2m20s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [2m30s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [2m40s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [2m50s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [3m0s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [3m10s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [3m20s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [3m30s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [3m40s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [3m50s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [4m0s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [4m10s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [4m20s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [4m30s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [4m40s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [4m50s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [5m0s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [5m10s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [5m20s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Still creating... [5m30s elapsed]
opentelekomcloud_rds_instance_v3.rds0: Creation complete after 5m32s [id=deba48a936604c9a9b591ce0580be25cin01]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
